# AirFluidType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceSettings..::..AirFluidType Property
FabricationServiceSettings Class See Also
---
A special fluid type for fabrication HVAC services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ElementId AirFluidType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AirFluidType As ElementId
	Get
```

Visual C++
---
```text
public:
static property ElementId^ AirFluidType {
	ElementId^ get ();
}
```

# See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace